{"sentences": ["Job Title: Web Application Developer", "Type: Full-time Permanent, Fully Remote", "Salary: Starting from £55,000 per year", "Benefits: Competitive salary + pension scheme, 25 days annual leave + bank holidays, Private Health Insurance offered for you and your family, Flexible working: home working as standard with occasional travel to attend meetings, Business hours are Monday – Friday, with flexibility, Option to work a 4-day week (pro-rata), Opportunity to learn at your own pace in areas that interest you and that are relevant to the team, Team meetings are held regularly (both online and face-to-face) to share ideas and socialize, Annual Pearfest - our annual music festival held at our HQ and an opportunity to joining a growing team with a strong culture of enthusiasm and high achievement", "Attention healthcare trailblazers! Are you passionate about delivering and developing cutting-edge software? Want to be part of the social network revolution in healthcare? Keen to work with a team that has over 200 years’ collective experience delivering innovative solutions to our health service? Look no further!", "My client is UK's leading medical technology company", "They pride themselves on doing things the right way, not necessarily the easy way, and their clients hold them in high regard for their innovative and proven applications that reshape what is possible for integrated shared care", "They believe the future of healthcare will be delivered by people, not technology", "That's why they’re looking for top talent in both healthcare and healthtec to join their core team of experts! We are seeking a talented and highly driven Web Application Developer to join in delivering their next-generation digital care planning products", "Working with our established, highly skilled team, developing and enhancing products for new and existing customers, the responsibilities of the Web Application Developer include:", "Working on single-page applications that communicate with our APIs and use components written by other team members", "Creating component libraries & utilities for use in front-end applications", "Designing UIs that deliver new functionality and solve problems for users", "Collaborating with other team members to integrate components and services", "Working closely alongside your manager to support and contribute to product development procedures so that the business’s agility, reliability, and security continually improve", "We're looking for passionate people who love working as part of a team", "You'll have a proactive, can-do attitude and enjoy contributing towards an adaptive, fun and creative environment", "You'll be capable of working cross-functionally, facilitating and collaborating with multiple stakeholder groups", "And you'll be a lifelong learner with the desire to be part of a team that learns, innovates and pushes boundaries as we continually evolve our high-performing, self-organising engineering team", "If you have an interest or experience in health and care, it would be an advantage, but isn't essential", "Key Skills", "Have worked in the similar capacity for 4 years with the relevant qualification", "A strong core understanding of HTML, JavaScript/Typescript and SCSS/CSS", "Deep understanding of AngularJS and/or Angular or similar web application framework e", "g", "React Vue, Svelte", "Ability to work independently", "Desirable Skills", "Experience with test driven development", "An understanding of the principles of good UX design", "Experience using UX/UI using Sketch/Figma/Adobe XD or similar to wireframe, prototype and design web applications & components", "A positive and self-confident attitude, with proven communication and team-working skills", "Experience working with Agile methodologies, clean code, solid principles, and test-driven development", "Experience with npm & NodeJS, nx build system and monorepos, authoring & maintaining an interface design standard/system and FHIR REST APIs to create, read and update healthcare data", "If we have caught your attention, a team with strong culture of enthusiasm and high achievement want to hear from you! Call the Kamro offices and ask for Romal!", "Job Types: Full-time, Permanent", "Salary: £55,000", "00-£65,000", "00 per year", "Benefits:", "Additional leave", "Casual dress", "Company pension", "Employee discount", "Free parking", "On-site parking", "Private medical insurance", "Work from home", "Schedule:", "Monday to Friday", "Overtime", "Supplemental pay types:", "Bonus scheme", "Performance bonus", "Yearly bonus", "Work Location: In person"], "segment": ["Key Skills", "Have worked in the similar capacity for 4 years with the relevant qualification", "A strong core understanding of HTML, JavaScript/Typescript and SCSS/CSS", "Deep understanding of AngularJS and/or Angular or similar web application framework e", "g", "React Vue, Svelte", "Ability to work independently", "Desirable Skills", "Experience with test driven development", "An understanding of the principles of good UX design", "Experience using UX/UI using Sketch/Figma/Adobe XD or similar to wireframe, prototype and design web applications & components", "A positive and self-confident attitude, with proven communication and team-working skills", "Experience working with Agile methodologies, clean code, solid principles, and test-driven development", "Experience with npm & NodeJS, nx build system and monorepos, authoring & maintaining an interface design standard/system and FHIR REST APIs to create, read and update healthcare data"]}