{"sentences": ["Salary: £35k - 46k per year + Remote Working", "Reference: COR5038B/1", "Manual Tester, Software Test Engineer, Regression Testing, Remote", "This is a great time for an experienced Manual Tester or Software Test Engineer, to join a global pharmaceutical consultancy, working on a remote basis", "The Role  As the Manual Tester, Software Test Engineer you will work alongside an exceptionally talented team of Software Testers, creating manual regression tests from scratch working within an Agile environment,  The Company The Manual Tester will join an innovative organisation, who are experiencing a period of rapid growth! Developing a suite of SaaS products used within the life science industry, this pioneering company uses the latest technologies and has created a great team environment, which rewards hard work and technical curiosity", "Benefits", "Flexible working, including remote", "25 days holiday", "5% Pension", "Private Medical", "What’s required of the Manual Test Engineer?", "Experience creating manual regression test scripts", "Experience with API testing", "Experience working within an Agile environment", "Any experience working within the Pharmaceutical or Life Sciences industry would really set your application apart", "What Next?", "If you have any questions or would simply welcome a chat about this excellent Manual Software Tester position and company, just call me or drop me an email, as I’d love to hear from you! If, though, you think this role could be right for you and you’d like to learn more, then please apply now", "Manual Tester, Software Test Engineer, Regression Testing, Remote", "Corriculo Ltd acts as an employment agency and an employment business", "#INDMED #inddev"], "segment": ["What’s required of the Manual Test Engineer?", "Experience creating manual regression test scripts", "Experience with API testing", "Experience working within an Agile environment", "Any experience working within the Pharmaceutical or Life Sciences industry would really set your application apart"]}