{"sentences": ["SOFTWARE DEVELOPMENT TEAM LEAD (CLOUD)", "REMOTE/Cardiff 1 day a month", "£80,000 (Negotiable)", "Our client, a leading technology manufacturer, are looking for an enthusiastic Software Development Team Lead to manage a team of developers working across a range of disciplines – from backend SQL databases to frontend Angular applications deployed on AWS and Azure", "This role is for a senior engineer experienced in strategy, design, development, and implementing large-scale products in the cloud - with management experience, or looking to take that next step into management", "BENEFITS", "This role offers 25 days holiday, plus an extra day for your birthday! Additional benefits include private medical care, a free company product, flexible working, a cycle to work scheme, and more", "RESPONSIBILITIES", "As a Software Development Team Lead, you will be:", "· Managing a team of 6 multi-disciplined engineers by running daily stand-ups, sprint plannings, reviews and retrospectives", "· Collaborating with other software developers, business analysts and software architects to plan, design, develop, test, and maintain cloud services built on Microsoft technologies and AWS", "· Ensuring high code quality and maintaining a set of best practices and coding standards", "· Getting involved in the recruitment process to continue building a strong team", "· Working with other team leads and stakeholders to build up product specifications, to develop and define solutions", "WHAT YOU NEED", "To be considered for the role of Software Development Team Lead you will need:", "· A working knowledge of a range of disciplines, from backend SQL databases to frontend Angular applications deployed on AWS and Azure", "· Great interpersonal skills, to form relationships with the team and manage accordingly", "· Experience managing a group of engineers with varying disciplines is desirable", "· A firm grasp of emerging technologies, platforms, and applications", "· Expertise in", "NET Core, Microsoft SQL Server, AWS, Azure, Angular, Apache Kafka, Infrastructure-as-Code tools, GitLab, Jira, Confluence, and other cloud-related technologies", "· Excellent communication, organizational, and problem-solving skill", "NEXT STEPS", "If you interested in becoming a Software Development Team Lead, then apply with you CV today! Our team will review your application to see if it’s a match and get in touch to learn more about you", "If you aren't contacted within 7 days, please assume your application was not selected", "Why wait? Don’t miss out", "Apply today!", "INDBR", "Job Types: Full-time, Permanent", "Salary: £80,000", "00 per year", "Benefits:", "Additional leave", "Cycle to work scheme", "Flexitime", "Private medical insurance", "Store discount", "Work from home", "Schedule:", "Flexitime", "Monday to Friday", "Application question(s):", "Can you commit to working in the Cardiff area 1 day a month?", "Are you a senior engineer – or in a similar role?", "Do you have any experience in managing or supervising a team?", "Do you have knowledge about a range of disciplines: backend SQL databases to frontend Angular applications?", "Work Location: RemoteFlexitime"], "segment": ["WHAT YOU NEED", "To be considered for the role of Software Development Team Lead you will need:", "· A working knowledge of a range of disciplines, from backend SQL databases to frontend Angular applications deployed on AWS and Azure", "· Great interpersonal skills, to form relationships with the team and manage accordingly", "· Experience managing a group of engineers with varying disciplines is desirable", "· A firm grasp of emerging technologies, platforms, and applications", "· Expertise in", "NET Core, Microsoft SQL Server, AWS, Azure, Angular, Apache Kafka, Infrastructure-as-Code tools, GitLab, Jira, Confluence, and other cloud-related technologies", "· Excellent communication, organizational, and problem-solving skill"]}