{"sentences": ["Salary: £40k - 42k per year + Benefits", "Reference: COR5007/1", "Software Engineer, Python, Git, Remote, Charity, COR5007", "Are you a Software Engineer looking to take a step-up in your career? Keen to take on leadership responsibilities, help structure and provide guidance to other developers on a range of projects? Are you keen to join a business that saves lives? If so, you'll want to apply for this role!", "The Role", "This is an excellent Software Engineer role, working for a company with a growing reputation in their field", "The Software Engineer will use knowledge of Python, Git and C# to come onboard and support in the leading and guidance of other developers within the business, on best practices, structure and project management", "The Company", "The Software Engineer will join a charity who support in the efforts of Humanitarian crises to help local governments, aid agencies and other authorities", "A truly worthwhile company who's work and support saves lives! The Software Engineer will contribute to a supportive team environment, which rewards hard work and innovative thinking", "The current work pattern in place is fully remote, excluding occasional team meetings and company days", "Benefits", "Some of the benefits on offer for the Software Engineer, include:", "30 days + BH", "Flexible working", "Training and progression opportunities", "What’s Required?", "The Ideal candidate for the role will have some of the following:", "Strong experience with Python", "A good understanding of Git and C#", "Any experience with Web APIs and REST APIs, systems integration or of leading other developers or projects would also be advantageous", "The list above is important, but not as important as hiring the right person! So if you don't meet all of the criteria above, but feel the role is of interest, please apply or get in touch today to discuss further", "So What's Next?", "If you are a Software Engineer currently, or looking to harness your career in this direction, and would like to know more about this excellent opportunity; apply now for immediate consideration!", "Software Engineer, Python, Git, Remote, Charity", "Corriculo Ltd acts as an employment agency and an employment business", "#indmed #INDDEV"], "segment": ["What’s Required?", "The Ideal candidate for the role will have some of the following:", "Strong experience with Python", "A good understanding of Git and C#", "Any experience with Web APIs and REST APIs, systems integration or of leading other developers or projects would also be advantageous", "The list above is important, but not as important as hiring the right person! So if you don't meet all of the criteria above, but feel the role is of interest, please apply or get in touch today to discuss further"]}