{"sentences": ["Software Developer – Reading – On site", "WHO ARE WE?", "Are you looking to build an exciting and dynamic career at a company with prestigious blue-chip clients and international reach? Dye & Durham, a leading global provider of cloud–based software and technology solutions, is focused on an unwavering commitment to customer excellence and to the personal and professional growth of its employees", "Dye & Durham provides critical information services and workflows used by clients all over the world to manage their process, information and regulatory requirements", "The company offers rewarding opportunities for those with legal, tech, financial services and sales expertise", "With clients that include major law firms, financial service institutions and government organizations in Canada, the United Kingdom, Ireland and Australia, a fulfilling career awaits you at Dye & Durham", "WHAT WILL YOU DO?", "Your role as a Software Developer will give you the opportunity to learn and develop, whilst contributing to some exciting projects from day 1", "Your core responsibilities will revolve around maintenance and extension of our existing code base, development of new products and working with leads and key stakeholders to meet business requirements", "You will have a wide and varied role, but we think the most important responsibilities will be;", "Develop, test and implement new software programs using a ASP", "NET/", "NET Core MVC tech stack", "Product Builds - Continual improvement, refinement of the existing product suite, as well as the creation of new products", "Maintenance of in-house systems, codebase, applications, and client integration", "Prepare documentation on the status, operation, and maintenance of software", "Clearly and regularly communicate with colleagues and stakeholders", "Participate in peer-reviews of solution designs and code reviews", "Pair with Senior Developers to continue to learn and develop, exploring new technologies and ways of working", "Work closely with all stakeholders to troubleshoot product and systems issues, exploring solutions and implementing long-term fixes to prevent recurrences", "WHAT DO YOU NEED TO BE CONSIDERED?", "We know you will have a wide range of skills and experience, but we think the most important to thrive in this role would be;", "Recent experience with ASP", "NET /", "NET CORE MVC in a commercial environment", "Experience of web-related technologies (HTML, XML, CSS, JSON, JavaScript, jQuery)", "MS SQL knowledge", "An inquisitive nature and a desire to learn and develop", "Conceptual grasp of SOLID design principles and Agile ways of working", "Entity Framework", "Angular and / or AngularJS", "Any cloud experience – preferably Azure – would be beneficial", "Be able to work on-site from our Reading office", "WHY WORK FOR US?", "At Dye & Durham we strive to be visionaries! As a leader in our field, we ensure our employees are ready for the next challenge in their journey with us by offering internal and external training opportunities", "We offer competitive salaries and a whole host of benefits including healthcare, pension, company discounts, wellness programs, and paid days off to move house or volunteer for your favourite charity", "WHAT NEXT?", "Hit apply and your application will be reviewed by our talent acquisition team who will contact you directly", "Please note that this position is subject to security checks", "Dye & Durham is an equal opportunity employer", "We provide opportunities without regard to race, colour, religion, sexual orientations, gender identity, national origin, marital or family status, disability status or other applicable legally protected characteristics", "Job Types: Full-time, Permanent", "Benefits:", "Casual dress", "Company events", "Company pension", "Employee discount", "Free parking", "Life insurance", "On-site gym", "On-site parking", "Paid volunteer time", "Private dental insurance", "Private medical insurance", "Referral programme", "Schedule:", "Monday to Friday", "Ability to commute/relocate:", "Reading: reliably commute or plan to relocate before starting work (required)", "Work authorisation:", "United Kingdom (required)", "Work Location: In person"], "segment": ["WHAT DO YOU NEED TO BE CONSIDERED?", "We know you will have a wide range of skills and experience, but we think the most important to thrive in this role would be;", "Recent experience with ASP", "NET /", "NET CORE MVC in a commercial environment", "Experience of web-related technologies (HTML, XML, CSS, JSON, JavaScript, jQuery)", "MS SQL knowledge", "An inquisitive nature and a desire to learn and develop", "Conceptual grasp of SOLID design principles and Agile ways of working", "Entity Framework", "Angular and / or AngularJS", "Any cloud experience – preferably Azure – would be beneficial", "Be able to work on-site from our Reading office"]}