{"sentences": ["Who are we?", "Halo Service Solutions is a fast-growing software company based in Suffolk, building innovative SaaS ITSM, PSA and Service Desk platforms for a global audience", "These platforms allow business and organisations of all kinds streamline their internal processes and ultimately gain efficiency", "Our experienced team has worked with prestigious organisations including the FBI, Sports Direct and Sony and we have ambitious plans to scale quickly over the next few years!", "Right now, we’re looking for new members of our team to join us on our journey", "At Halo you’ll play a pivotal role in our success from day one, gaining experience on exciting development projects with direct support from our senior development team", "Whilst you can expect to have ownership of your own projects, the development team work collaboratively to share ideas in our work-hard, play-hard environment", "A little about you…", "Keen to have ownership of your own development projects", "Always looking for opportunities to innovate new areas in the system", "Interested in fixing bugs and working with our customers to improve our web-apps", "BSc in Computer Science, Mathematics or similar", "Will develop new and existing integrations with other leading platforms", "Excited to help drive innovation, offer new ideas and think up new ways of tackling problems!", "Preferred Skills and Experience:", "React", "Net core", "C#", "Javascript/CSS/HTML", "SQL", "We will accept applications from those who do not meet all the above criteria", "But what’s in it for you?", "Competitive salary (scaling depending on experience)", "Office concessions (snacks, coffee/tea, fruit, and most importantly, beers)", "Team socials, challenges & off-site visits to our global customers", "Having a direct input into our culture, perks and policies", "We consider all applications that come our way, no matter where you’re from or your background", "Our workplace welcomes everyone, and we’re looking forward to you bringing your perspectives and voice to the company", "Read more about our culture and the graduate scheme here: https://haloitsm", "com/careers/", "COVID-19 precaution(s):", "Virtual meetings", "Flexible Working Options Available:", "Not offered", "Work remotely", "No", "Job Types: Full-time, Permanent", "Salary: From £30,000", "00 per year", "Schedule:", "Monday to Friday", "Education:", "Bachelor's (preferred)", "Work Location: In person"], "segment": ["Preferred Skills and Experience:", "React", "Net core", "C#", "Javascript/CSS/HTML", "SQL"]}