{"sentences": ["Brought together by a shared passion for making work easy", "Our team of Changing Socialites have a broad range of industry experience, deep product knowledge across Microsoft technologies and a unique ability to embed sustained change within some of the most complex organisations on the planet", "We are a team of learn-it-all’s and as a company we invest heavily in learning and development to ensure that you receive nothing but a world-class experience when working with us", "Our core values; loveability, openness, versatility and enthusiasm are what unite us", "WE LOVE FINDING SOLUTIONS", "We have helped some of the largest brands on this planet solve business challenges using the Microsoft Power Platform", "We love finding solutions to make work easy for businesses", "We want to show the world, what we can do to help", "Location:", "Bristol Area", "Salary: 16,000k", "Hours: 9-5", "30pm ( 1 hour break)", "Job Type:", "Full-Time", "Job Description:", "Do you want to kick start your career in software development? Come and join an organisation that specialises in digital adoption across all Microsoft 365 technologies, focussing on the end user’s experience as well as the latest technology", "Highlights include:", "· Working with our Strategy & Change and End User Adoption Teams to gain an insight into digital transformation across the whole of Microsoft 365", "· Working within our Power Platform team to understand how software is delivered within industry whilst always considering time, cost, and scope", "· Building apps, chat bots, and automations to help improve everyone’s ability to deliver", "· Supporting our existing colleagues with their own IT challenges across the Power Platform", "· An opportunity to gain Microsoft certifications within the industry to further progress your career", "The first 2-3 months will be in office 4/5 days a week and then it will roll out to remote working and flexible hours", "Job Types: Full-time, Apprenticeship", "Salary: £16,000", "00 per year", "Benefits:", "Company events", "Company pension", "Flexitime", "Sick pay", "Work from home", "Schedule:", "Flexitime", "Monday to Friday", "Ability to commute/relocate:", "Bristol: reliably commute or plan to relocate before starting work (required)", "Application question(s):", "What software/IT experience do you have?", "Do you have experience using Microsoft 365, SharePoint, Outlook and Microsoft Teams?", "Education:", "GCSE or equivalent (required)", "Work Location: In personFlexitime"], "segment": ["Education:", "GCSE or equivalent (required)"]}