{"sentences": ["Do you have at least 1 years worth of studio experience and looking for your next role? Are you looking to put your new skills to the test and learn from an experienced team? Are you excited to collaborate with a team of innovative and passionate developers in a games studio that has the wellbeing of employees at the forefront of our ethics? AntiMatter Games asks you to read on!", "You’ll be bringing your experience and knowledge to our robust coding department working on exciting projects such as our current project IGI: Origins", "This is a permanent role based onsite in our Cornwall Studio (working 2 days a week from home optionally)", "DUTIES AND RESPONSIBILITIES", "Translate designs and requirements into clean and efficient code", "Create and iterate on features in an existing codebase, or from the genesis of a new project using effective, re-usable, effectively structured and annotated code", "Implement all technical aspects of games such as networking, animation, effects, UI, audio", "Produce prototypes of gameplay ideas and features from design team", "Analyse, identify the causes of and resolve bugs that are provided by our QA team", "Communicate effectively with our design team & project leadership about the practical and technical concerns of proposed features and content, including timeframes and any relevant technical limitations", "ESSENTIAL REQUIREMENTS", "At least 1 years worth of studio experience", "Familiarity with C++ programming and systems design skills", "Be able to demonstrate a strong skillset and passion for creating games", "BSc in Computer Science (or equivalent)", "Proactive, autonomous and self-motivating", "Strong communication and teamwork skills", "Passion for first person shooters", "BENEFICIAL SKILLS", "Good math and physics skills", "Experience with JIRA and/or Agile software development", "Experience with Unreal Engine 4/5", "Why Antimatter?", "AntiMatter Games is Cornwall’s largest game development studio", "We developed Rising Storm, PC Gamer’s ‘Multiplayer Game of the Year’, and the critically acclaimed sequel Rising Storm 2: Vietnam", "Working for Antimatter means working on exciting and innovative video games every day! We have a strong company culture, where our employees are encouraged to have an excellent work-life balance", "We want to support our team to become the best developers they can be, whatever their department", "Based in waterside offices in Truro, the UK's most Southerly city, AntiMatter Games' offices are within a few minutes walk of Cornwall's shopping, culture and eating hub", "Accessible by bus or train, and with private car parking, or for the more adventurous, you could kayak to work! Perfectly positioned to explore the tranquil South Coast or the crashing Atlantic North Coast, we offer an unrivalled life/work experience for those making games in the UK", "On weekends and evenings, our team can be found cycling, surfing, kayaking, swimming, beachcombing, walking, enjoying live music or capturing beautiful sights by camera", "On rainy days you might find a friendly game of Dungeons & Dragons or a book to read by the fireplace", "Sometimes we also play video games!", "Other Information", "UK Employees will receive Private Health Insurance, a BUPA Cash Plan and subscription to PerkBox, which includes hundreds of perks, freebies and discounts on its platform", "This is an onsite role with optional work from home days each week", "There are no sponsorship options available for this role", "For information on how we process your data, our data protection policy for candidates can be found here https://www", "antimattergames", "com/privacy-policy/"], "segment": ["ESSENTIAL REQUIREMENTS", "At least 1 years worth of studio experience", "Familiarity with C++ programming and systems design skills", "Be able to demonstrate a strong skillset and passion for creating games", "BSc in Computer Science (or equivalent)", "Proactive, autonomous and self-motivating", "Strong communication and teamwork skills", "Passion for first person shooters", "BENEFICIAL SKILLS", "Good math and physics skills", "Experience with JIRA and/or Agile software development", "Experience with Unreal Engine 4/5"]}